Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceDoesNotCutMeshFace Property
 The surface-based splitter does not intersect a face to be divided and will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCuttingSurfaceDoesNotCutMeshFace { get; }
Public Shared ReadOnly Property DividedSurfaceCuttingSurfaceDoesNotCutMeshFace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCuttingSurfaceDoesNotCutMeshFace {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCuttingSurfaceDoesNotCutMeshFace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace